In [40]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [43]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [44]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
le_Sex = LabelEncoder()

In [12]:
inputs['le_Sex'] = le_name.fit_transform(inputs['Sex'])

In [34]:
target[:100]

0     0
1     1
2     1
3     1
4     0
     ..
95    0
96    0
97    1
98    1
99    0
Name: Survived, Length: 100, dtype: int64

In [22]:
inputs_n = inputs.drop(['Sex'],axis = 'columns')
inputs_n[:10]

   Pclass   Age     Fare  le_Sex
0       3  22.0   7.2500       1
1       1  38.0  71.2833       0
2       3  26.0   7.9250       0
3       1  35.0  53.1000       0
4       3  35.0   8.0500       1
5       3   NaN   8.4583       1
6       1  54.0  51.8625       1
7       3   2.0  21.0750       1
8       3  27.0  11.1333       0
9       2  14.0  30.0708       0

In [57]:
inputs_n.Age = inputs_n.Age.fillna(inputs_n.Age.mean())
inputs_n.head()

   Pclass   Age     Fare  le_Sex
0       3  22.0   7.2500       1
1       1  38.0  71.2833       0
2       3  26.0   7.9250       0
3       1  35.0  53.1000       0
4       3  35.0   8.0500       1

In [58]:
from sklearn import tree
from sklearn.model_selection import train_test_split

In [59]:
model = tree.DecisionTreeClassifier()

In [60]:
X_train, X_test, y_train, y_test = train_test_split(inputs_n,target,test_size=0.2)

In [61]:
len(X_train)

712

In [62]:
len(X_test)

179

In [65]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [64]:
model.score(X_test,y_test)

0.770949720670391